// 8.Вывести на экран числа от -N до N

int N=9;
int _N=N*-1;
while (_N<=N) 
{
    System.Console.Write($"{_N} ");
    _N++;
}